In [2]:
!pip install numpy

!pip install pandas

Requirement already satisfied: numpy in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (1.25.0)
Requirement already satisfied: pandas in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from pandas) (1.25.0)
Requirement already satisfied: six>=1.5 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import numpy as np
import pandas as pd

In [3]:
categories = ['a', 'b', 'c']
categories

['a', 'b', 'c']

In [4]:
my_list = [-1, -2, -3]
my_list

[-1, -2, -3]

In [5]:
arr = np.array([100,99,98])
arr

array([100,  99,  98])

In [6]:
my_dict = {'Item1': 999, 'Item2': 888, 'Item3': 777}
my_dict

{'Item1': 999, 'Item2': 888, 'Item3': 777}

In [7]:
# pd.Series() based on a python list. Argument is data. Indexed 0, 1, 2.

In [8]:
pd.Series(data=my_list)

0   -1
1   -2
2   -3
dtype: int64

In [9]:
pd.Series(data = categories)

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series(data=my_list, index=categories)

a   -1
b   -2
c   -3
dtype: int64

In [11]:
pd.Series(data=my_list, index=categories, name = "My First Series")

a   -1
b   -2
c   -3
Name: My First Series, dtype: int64

In [12]:
pd.Series(data=categories)

0    a
1    b
2    c
dtype: object

In [13]:
pd.Series(data=arr)

0    100
1     99
2     98
dtype: int64

In [14]:
pd.Series(index=categories, data=arr, name = 'Array')

a    100
b     99
c     98
Name: Array, dtype: int64

In [15]:
#Data frames Set of series put together to share the same index.

In [16]:
np.random.seed(101)
df = pd.DataFrame(data = np.random.randn(5,4),
                  index = ['A','B','C','D','E'],
                  columns = ['Col1','Col2','Col3','Col4'])
df

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
dict1 = {'Item1':[9,9,7,1], 'Item2':[8,6,68,8], 'Item3':[1,2,7,8]}
dict1

{'Item1': [9, 9, 7, 1], 'Item2': [8, 6, 68, 8], 'Item3': [1, 2, 7, 8]}

In [18]:
df = pd.DataFrame(data=dict1)
df

   Item1  Item2  Item3
0      9      8      1
1      9      6      2
2      7     68      7
3      1      8      8

In [19]:
print(df)

   Item1  Item2  Item3
0      9      8      1
1      9      6      2
2      7     68      7
3      1      8      8

In [20]:
np.random.seed(101)
df = pd.DataFrame(data=np.random.randn(10,40))
df

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
0,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,-0.848077,0.605965,-2.018168,0.740122,...,0.638787,0.329646,-0.497104,-0.754070,-0.943406,0.484752,-0.116773,1.901755,0.238127,1.996652
1,-0.993263,0.196800,-1.136645,0.000366,1.025984,-0.156598,-0.031579,0.649826,2.154846,-0.610259,...,0.187125,-0.732845,-1.382920,1.482495,0.961458,-2.141212,0.992573,1.192241,-1.046780,1.292765
2,-1.467514,-0.494095,-0.162535,0.485809,0.392489,0.221491,-0.855196,1.541990,0.666319,-0.538235,...,0.649148,0.358941,-1.080471,0.902398,0.161781,0.833029,0.975720,-0.388239,0.783316,-0.708954
3,0.586847,-1.621348,0.677535,0.026105,-1.678284,0.333973,-0.532471,2.117727,0.197524,2.302987,...,-0.971393,-1.522333,1.133703,0.528187,0.393461,-0.630507,-1.398290,-0.219311,-0.045676,0.012421
4,0.093628,1.240813,-1.097693,-1.908009,-0.380104,-1.666059,-2.736995,1.522562,0.178009,-0.626805,...,-1.235614,-0.798428,0.754121,-0.772041,-0.034432,0.688408,0.081523,-0.415191,0.053661,-2.115113
5,-0.279510,1.062710,1.752014,0.695547,0.153661,0.167638,-0.765930,0.962299,0.902826,-0.537909,...,-1.029577,-1.524856,-0.854860,1.602816,0.185479,-0.994018,-0.131906,-1.335092,-0.089298,0.698566
6,-1.409126,0.870907,1.585812,0.929658,-0.550876,0.942045,-0.975349,-1.054851,2.165421,-1.267240,...,0.834355,-0.140432,0.119145,0.665715,0.407586,0.807843,-2.736464,-0.985153,-0.155276,-1.013228
7,-1.087436,-2.567767,0.661029,-0.332921,-0.928602,1.715950,-0.468756,0.860097,0.230087,0.618658,...,-0.051203,-0.439128,-1.501041,1.058357,1.854967,0.502250,0.114581,-0.368487,0.459343,0.585513
8,-0.181904,-0.603235,-2.552660,-0.031927,1.407189,0.060971,-1.542393,-0.821110,-1.599171,-2.068836,...,-1.883809,-1.314142,2.601240,-0.612552,-1.714963,1.350046,1.798990,-1.312854,0.033590,-0.220208
9,-0.308472,-0.842066,-0.831162,-0.493941,0.552794,-0.190511,0.231609,0.155412,-0.195703,-0.652119,...,-1.194699,-0.145231,0.013519,-2.156488,-0.494917,0.071770,-1.291559,1.001002,1.669011,1.480148

In [21]:
print(df)

         0         1         2         3         4         5         6   \
0  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318 -0.848077
1 -0.993263  0.196800 -1.136645  0.000366  1.025984 -0.156598 -0.031579
2 -1.467514 -0.494095 -0.162535  0.485809  0.392489  0.221491 -0.855196
3  0.586847 -1.621348  0.677535  0.026105 -1.678284  0.333973 -0.532471
4  0.093628  1.240813 -1.097693 -1.908009 -0.380104 -1.666059 -2.736995
5 -0.279510  1.062710  1.752014  0.695547  0.153661  0.167638 -0.765930
6 -1.409126  0.870907  1.585812  0.929658 -0.550876  0.942045 -0.975349
7 -1.087436 -2.567767  0.661029 -0.332921 -0.928602  1.715950 -0.468756
8 -0.181904 -0.603235 -2.552660 -0.031927  1.407189  0.060971 -1.542393
9 -0.308472 -0.842066 -0.831162 -0.493941  0.552794 -0.190511  0.231609

         7         8         9   ...        30        31        32        33  \
0  0.605965 -2.018168  0.740122  ...  0.638787  0.329646 -0.497104 -0.754070
1  0.649826  2.154846 -0.610259  ...  0.187125 -0.732845 -1.382920  1.482495
2  1.541990  0.666319 -0.538235  ...  0.649148  0.358941 -1.080471  0.902398
3  2.117727  0.197524  2.302987  ... -0.971393 -1.522333  1.133703  0.528187
4  1.522562  0.178009 -0.626805  ... -1.235614 -0.798428  0.754121 -0.772041
5  0.962299  0.902826 -0.537909  ... -1.029577 -1.524856 -0.854860  1.602816
6 -1.054851  2.165421 -1.267240  ...  0.834355 -0.140432  0.119145  0.665715
7  0.860097  0.230087  0.618658  ... -0.051203 -0.439128 -1.501041  1.058357
8 -0.821110 -1.599171 -2.068836  ... -1.883809 -1.314142  2.601240 -0.612552
9  0.155412 -0.195703 -0.652119  ... -1.194699 -0.145231  0.013519 -2.156488

         34        35        36        37        38        39
0 -0.943406  0.484752 -0.116773  1.901755  0.238127  1.996652
1  0.961458 -2.141212  0.992573  1.192241 -1.046780  1.292765
2  0.161781  0.833029  0.975720 -0.388239  0.783316 -0.708954
3  0.393461 -0.630507 -1.398290 -0.219311 -0.045676  0.012421
4 -0.034432  0.688408  0.081523 -0.415191  0.053661 -2.115113
5  0.185479 -0.994018 -0.131906 -1.335092 -0.089298  0.698566
6  0.407586  0.807843 -2.736464 -0.985153 -0.155276 -1.013228
7  1.854967  0.502250  0.114581 -0.368487  0.459343  0.585513
8 -1.714963  1.350046  1.798990 -1.312854  0.033590 -0.220208
9 -0.494917  0.071770 -1.291559  1.001002  1.669011  1.480148

[10 rows x 40 columns]

In [22]:
df2 = df.copy()

In [23]:
df

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
0,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,-0.848077,0.605965,-2.018168,0.740122,...,0.638787,0.329646,-0.497104,-0.754070,-0.943406,0.484752,-0.116773,1.901755,0.238127,1.996652
1,-0.993263,0.196800,-1.136645,0.000366,1.025984,-0.156598,-0.031579,0.649826,2.154846,-0.610259,...,0.187125,-0.732845,-1.382920,1.482495,0.961458,-2.141212,0.992573,1.192241,-1.046780,1.292765
2,-1.467514,-0.494095,-0.162535,0.485809,0.392489,0.221491,-0.855196,1.541990,0.666319,-0.538235,...,0.649148,0.358941,-1.080471,0.902398,0.161781,0.833029,0.975720,-0.388239,0.783316,-0.708954
3,0.586847,-1.621348,0.677535,0.026105,-1.678284,0.333973,-0.532471,2.117727,0.197524,2.302987,...,-0.971393,-1.522333,1.133703,0.528187,0.393461,-0.630507,-1.398290,-0.219311,-0.045676,0.012421
4,0.093628,1.240813,-1.097693,-1.908009,-0.380104,-1.666059,-2.736995,1.522562,0.178009,-0.626805,...,-1.235614,-0.798428,0.754121,-0.772041,-0.034432,0.688408,0.081523,-0.415191,0.053661,-2.115113
5,-0.279510,1.062710,1.752014,0.695547,0.153661,0.167638,-0.765930,0.962299,0.902826,-0.537909,...,-1.029577,-1.524856,-0.854860,1.602816,0.185479,-0.994018,-0.131906,-1.335092,-0.089298,0.698566
6,-1.409126,0.870907,1.585812,0.929658,-0.550876,0.942045,-0.975349,-1.054851,2.165421,-1.267240,...,0.834355,-0.140432,0.119145,0.665715,0.407586,0.807843,-2.736464,-0.985153,-0.155276,-1.013228
7,-1.087436,-2.567767,0.661029,-0.332921,-0.928602,1.715950,-0.468756,0.860097,0.230087,0.618658,...,-0.051203,-0.439128,-1.501041,1.058357,1.854967,0.502250,0.114581,-0.368487,0.459343,0.585513
8,-0.181904,-0.603235,-2.552660,-0.031927,1.407189,0.060971,-1.542393,-0.821110,-1.599171,-2.068836,...,-1.883809,-1.314142,2.601240,-0.612552,-1.714963,1.350046,1.798990,-1.312854,0.033590,-0.220208
9,-0.308472,-0.842066,-0.831162,-0.493941,0.552794,-0.190511,0.231609,0.155412,-0.195703,-0.652119,...,-1.194699,-0.145231,0.013519,-2.156488,-0.494917,0.071770,-1.291559,1.001002,1.669011,1.480148

In [24]:
df2

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
0,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,-0.848077,0.605965,-2.018168,0.740122,...,0.638787,0.329646,-0.497104,-0.754070,-0.943406,0.484752,-0.116773,1.901755,0.238127,1.996652
1,-0.993263,0.196800,-1.136645,0.000366,1.025984,-0.156598,-0.031579,0.649826,2.154846,-0.610259,...,0.187125,-0.732845,-1.382920,1.482495,0.961458,-2.141212,0.992573,1.192241,-1.046780,1.292765
2,-1.467514,-0.494095,-0.162535,0.485809,0.392489,0.221491,-0.855196,1.541990,0.666319,-0.538235,...,0.649148,0.358941,-1.080471,0.902398,0.161781,0.833029,0.975720,-0.388239,0.783316,-0.708954
3,0.586847,-1.621348,0.677535,0.026105,-1.678284,0.333973,-0.532471,2.117727,0.197524,2.302987,...,-0.971393,-1.522333,1.133703,0.528187,0.393461,-0.630507,-1.398290,-0.219311,-0.045676,0.012421
4,0.093628,1.240813,-1.097693,-1.908009,-0.380104,-1.666059,-2.736995,1.522562,0.178009,-0.626805,...,-1.235614,-0.798428,0.754121,-0.772041,-0.034432,0.688408,0.081523,-0.415191,0.053661,-2.115113
5,-0.279510,1.062710,1.752014,0.695547,0.153661,0.167638,-0.765930,0.962299,0.902826,-0.537909,...,-1.029577,-1.524856,-0.854860,1.602816,0.185479,-0.994018,-0.131906,-1.335092,-0.089298,0.698566
6,-1.409126,0.870907,1.585812,0.929658,-0.550876,0.942045,-0.975349,-1.054851,2.165421,-1.267240,...,0.834355,-0.140432,0.119145,0.665715,0.407586,0.807843,-2.736464,-0.985153,-0.155276,-1.013228
7,-1.087436,-2.567767,0.661029,-0.332921,-0.928602,1.715950,-0.468756,0.860097,0.230087,0.618658,...,-0.051203,-0.439128,-1.501041,1.058357,1.854967,0.502250,0.114581,-0.368487,0.459343,0.585513
8,-0.181904,-0.603235,-2.552660,-0.031927,1.407189,0.060971,-1.542393,-0.821110,-1.599171,-2.068836,...,-1.883809,-1.314142,2.601240,-0.612552,-1.714963,1.350046,1.798990,-1.312854,0.033590,-0.220208
9,-0.308472,-0.842066,-0.831162,-0.493941,0.552794,-0.190511,0.231609,0.155412,-0.195703,-0.652119,...,-1.194699,-0.145231,0.013519,-2.156488,-0.494917,0.071770,-1.291559,1.001002,1.669011,1.480148

In [25]:
df

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
0,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,-0.848077,0.605965,-2.018168,0.740122,...,0.638787,0.329646,-0.497104,-0.754070,-0.943406,0.484752,-0.116773,1.901755,0.238127,1.996652
1,-0.993263,0.196800,-1.136645,0.000366,1.025984,-0.156598,-0.031579,0.649826,2.154846,-0.610259,...,0.187125,-0.732845,-1.382920,1.482495,0.961458,-2.141212,0.992573,1.192241,-1.046780,1.292765
2,-1.467514,-0.494095,-0.162535,0.485809,0.392489,0.221491,-0.855196,1.541990,0.666319,-0.538235,...,0.649148,0.358941,-1.080471,0.902398,0.161781,0.833029,0.975720,-0.388239,0.783316,-0.708954
3,0.586847,-1.621348,0.677535,0.026105,-1.678284,0.333973,-0.532471,2.117727,0.197524,2.302987,...,-0.971393,-1.522333,1.133703,0.528187,0.393461,-0.630507,-1.398290,-0.219311,-0.045676,0.012421
4,0.093628,1.240813,-1.097693,-1.908009,-0.380104,-1.666059,-2.736995,1.522562,0.178009,-0.626805,...,-1.235614,-0.798428,0.754121,-0.772041,-0.034432,0.688408,0.081523,-0.415191,0.053661,-2.115113
5,-0.279510,1.062710,1.752014,0.695547,0.153661,0.167638,-0.765930,0.962299,0.902826,-0.537909,...,-1.029577,-1.524856,-0.854860,1.602816,0.185479,-0.994018,-0.131906,-1.335092,-0.089298,0.698566
6,-1.409126,0.870907,1.585812,0.929658,-0.550876,0.942045,-0.975349,-1.054851,2.165421,-1.267240,...,0.834355,-0.140432,0.119145,0.665715,0.407586,0.807843,-2.736464,-0.985153,-0.155276,-1.013228
7,-1.087436,-2.567767,0.661029,-0.332921,-0.928602,1.715950,-0.468756,0.860097,0.230087,0.618658,...,-0.051203,-0.439128,-1.501041,1.058357,1.854967,0.502250,0.114581,-0.368487,0.459343,0.585513
8,-0.181904,-0.603235,-2.552660,-0.031927,1.407189,0.060971,-1.542393,-0.821110,-1.599171,-2.068836,...,-1.883809,-1.314142,2.601240,-0.612552,-1.714963,1.350046,1.798990,-1.312854,0.033590,-0.220208
9,-0.308472,-0.842066,-0.831162,-0.493941,0.552794,-0.190511,0.231609,0.155412,-0.195703,-0.652119,...,-1.194699,-0.145231,0.013519,-2.156488,-0.494917,0.071770,-1.291559,1.001002,1.669011,1.480148

In [26]:
df['Col1']

KeyError: 'Col1'

In [ ]:
df[['Col1', 'Col2']]

       Col1      Col2
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [ ]:
df.filter(['Col1', 'Col2'], axis = 1)

       Col1      Col2
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [ ]:
df['Col5'] = df['Col1'] + df['Col3']
df

       Col1      Col2      Col3      Col4      Col5
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### Drop Columns use Axis = 0

In [ ]:
df.drop(labels = ['Col5'], axis = 1)

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

       Col1      Col2      Col3      Col4      Col5
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### To save changes we use inplace = True

In [ ]:
df.drop(labels = ['Col5'], axis = 1, inplace = True)

In [ ]:
df

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Drop rows:

In [ ]:
df.drop(labels=['A', 'E'], axis = 0)

       Col1      Col2      Col3      Col4
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [ ]:
df

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
0,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,-0.848077,0.605965,-2.018168,0.740122,...,0.638787,0.329646,-0.497104,-0.754070,-0.943406,0.484752,-0.116773,1.901755,0.238127,1.996652
1,-0.993263,0.196800,-1.136645,0.000366,1.025984,-0.156598,-0.031579,0.649826,2.154846,-0.610259,...,0.187125,-0.732845,-1.382920,1.482495,0.961458,-2.141212,0.992573,1.192241,-1.046780,1.292765
2,-1.467514,-0.494095,-0.162535,0.485809,0.392489,0.221491,-0.855196,1.541990,0.666319,-0.538235,...,0.649148,0.358941,-1.080471,0.902398,0.161781,0.833029,0.975720,-0.388239,0.783316,-0.708954
3,0.586847,-1.621348,0.677535,0.026105,-1.678284,0.333973,-0.532471,2.117727,0.197524,2.302987,...,-0.971393,-1.522333,1.133703,0.528187,0.393461,-0.630507,-1.398290,-0.219311,-0.045676,0.012421
4,0.093628,1.240813,-1.097693,-1.908009,-0.380104,-1.666059,-2.736995,1.522562,0.178009,-0.626805,...,-1.235614,-0.798428,0.754121,-0.772041,-0.034432,0.688408,0.081523,-0.415191,0.053661,-2.115113
5,-0.279510,1.062710,1.752014,0.695547,0.153661,0.167638,-0.765930,0.962299,0.902826,-0.537909,...,-1.029577,-1.524856,-0.854860,1.602816,0.185479,-0.994018,-0.131906,-1.335092,-0.089298,0.698566
6,-1.409126,0.870907,1.585812,0.929658,-0.550876,0.942045,-0.975349,-1.054851,2.165421,-1.267240,...,0.834355,-0.140432,0.119145,0.665715,0.407586,0.807843,-2.736464,-0.985153,-0.155276,-1.013228
7,-1.087436,-2.567767,0.661029,-0.332921,-0.928602,1.715950,-0.468756,0.860097,0.230087,0.618658,...,-0.051203,-0.439128,-1.501041,1.058357,1.854967,0.502250,0.114581,-0.368487,0.459343,0.585513
8,-0.181904,-0.603235,-2.552660,-0.031927,1.407189,0.060971,-1.542393,-0.821110,-1.599171,-2.068836,...,-1.883809,-1.314142,2.601240,-0.612552,-1.714963,1.350046,1.798990,-1.312854,0.033590,-0.220208
9,-0.308472,-0.842066,-0.831162,-0.493941,0.552794,-0.190511,0.231609,0.155412,-0.195703,-0.652119,...,-1.194699,-0.145231,0.013519,-2.156488,-0.494917,0.071770,-1.291559,1.001002,1.669011,1.480148

In [ ]:
df.loc['A']

Col1    2.706850
Col2    0.628133
Col3    0.907969
Col4    0.503826
Name: A, dtype: float64

### When slicing using .loc, the last value is included which is not usual in python.

In [ ]:
df.loc['A':'D']

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [ ]:
df.loc['A':'C']

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [ ]:
df.loc['A':'C']

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [ ]:
df.loc[['A','D']]

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [ ]:
df.loc['D', 'Col3']

-0.9332372163009188

In [ ]:
df.loc[['A', 'E'], ['Col1', 'Col3']]

       Col1      Col3
A  2.706850  0.907969
E  0.190794  2.605967

In [ ]:
df.loc[['A'], ['Col2', 'Col4']]

       Col2      Col4
A  0.628133  0.503826

### iloc subsets data frame based on index location

In [ ]:
df.iloc[0]

Col1    2.706850
Col2    0.628133
Col3    0.907969
Col4    0.503826
Name: A, dtype: float64

In [ ]:
df.iloc[:3, :4]

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [ ]:
df.iloc[-3:, -1:]

       Col4
C -0.589001
D  0.955057
E  0.683509

In [ ]:
df

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### query() Boolean approach.

In [ ]:
df[df['Col4']>1]

Empty DataFrame
Columns: [Col1, Col2, Col3, Col4]
Index: []

In [ ]:
df.query("Col4>0.6")

       Col1      Col2      Col3      Col4
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.query('Col4> 0 and Col1 > 0.5')

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [ ]:
df.query('Col2 > 0.8 or Col2 < 0 and Col1 > 0.5')

       Col1      Col2      Col3      Col4
B  0.651118 -0.319318 -0.848077  0.605965
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.query('(Col2 > 0.8 or Col2 < 0) and Col1 > 0.5')

       Col1      Col2      Col3      Col4
B  0.651118 -0.319318 -0.848077  0.605965

In [ ]:
df.query('(Col3>0.4 or Col4>0.7) and Col1<0.2')

       Col1      Col2      Col3      Col4
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Index and MultiIndex

In [ ]:
df

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [ ]:
df.reset_index()

  index      Col1      Col2      Col3      Col4
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.reset_index(drop = True, inplace = True)
df

       Col1      Col2      Col3      Col4
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [ ]:
df['Col5'] = ['Part1', 'Part2', 'Part3', 'Item1', 'Item2']
df

       Col1      Col2      Col3      Col4   Col5
0  2.706850  0.628133  0.907969  0.503826  Part1
1  0.651118 -0.319318 -0.848077  0.605965  Part2
2 -2.018168  0.740122  0.528813 -0.589001  Part3
3  0.188695 -0.758872 -0.933237  0.955057  Item1
4  0.190794  1.978757  2.605967  0.683509  Item2

In [ ]:
df.set_index('Col5', inplace=True)
df

           Col1      Col2      Col3      Col4
Col5
Part1  2.706850  0.628133  0.907969  0.503826
Part2  0.651118 -0.319318 -0.848077  0.605965
Part3 -2.018168  0.740122  0.528813 -0.589001
Item1  0.188695 -0.758872 -0.933237  0.955057
Item2  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.index

Index(['Part1', 'Part2', 'Part3', 'Item1', 'Item2'], dtype='object', name='Col5')

In [ ]:
df

           Col1      Col2      Col3      Col4
Col5
Part1  2.706850  0.628133  0.907969  0.503826
Part2  0.651118 -0.319318 -0.848077  0.605965
Part3 -2.018168  0.740122  0.528813 -0.589001
Item1  0.188695 -0.758872 -0.933237  0.955057
Item2  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [ ]:
np.random.seed(seed=13)
df = pd.DataFrame(data={'Col1':np.random.randint(low=10, high=20, size=10),
                        'Col2':np.random.randint(low=-10, high=0, size=10),
                        'Category1':np.random.choice(['X', 'Y', 'Z'], size=10),
                        'Category2': np.random.choice(['a','b','c','d','e','f','g'], size=10)}
                        )
df

   Col1  Col2 Category1 Category2
0    12    -4         Y         e
1    10    -5         Y         f
2    10    -1         Z         d
3    16    -6         X         f
4    12    -8         X         a
5    14   -10         X         d
6    19    -7         X         c
7    13    -5         Z         a
8    14    -7         Z         f
9    12    -4         Z         b

In [ ]:
df.set_index(['Category1', 'Category2'], inplace=True)
df

                     Col1  Col2
Category1 Category2
Y         e            12    -4
          f            10    -5
Z         d            10    -1
X         f            16    -6
          a            12    -8
          d            14   -10
          c            19    -7
Z         a            13    -5
          f            14    -7
          b            12    -4

In [ ]:
df.index

MultiIndex([('Y', 'e'),
            ('Y', 'f'),
            ('Z', 'd'),
            ('X', 'f'),
            ('X', 'a'),
            ('X', 'd'),
            ('X', 'c'),
            ('Z', 'a'),
            ('Z', 'f'),
            ('Z', 'b')],
           names=['Category1', 'Category2'])

In [ ]:
df.index.names

FrozenList(['Category1', 'Category2'])

In [ ]:
df.reset_index(inplace=True)

In [ ]:
df

  Category1 Category2  Col1  Col2
0         Y         e    12    -4
1         Y         f    10    -5
2         Z         d    10    -1
3         X         f    16    -6
4         X         a    12    -8
5         X         d    14   -10
6         X         c    19    -7
7         Z         a    13    -5
8         Z         f    14    -7
9         Z         b    12    -4

In [ ]:
!ls

 app.ipynb  'Pandas training.ipynb'   testpandas.xlsx   Untitled.ipynb

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/Code-Institute-Solutions/sample-datasets/main/flights.csv',
                 index_col=['year'])
df

          month  passengers
year
1949    January         112
1949   February         118
1949      March         132
1949      April         129
1949        May         121
...         ...         ...
1960     August         606
1960  September         508
1960    October         461
1960   November         390
1960   December         432

[144 rows x 2 columns]

In [ ]:

df

          month  passengers
year
1949    January         112
1949   February         118
1949      March         132
1949      April         129
1949        May         121
...         ...         ...
1960     August         606
1960  September         508
1960    October         461
1960   November         390
1960   December         432

[144 rows x 2 columns]

In [ ]:
df.index

Index([1949, 1949, 1949, 1949, 1949, 1949, 1949, 1949, 1949, 1949,
       ...
       1960, 1960, 1960, 1960, 1960, 1960, 1960, 1960, 1960, 1960],
      dtype='int64', name='year', length=144)

In [ ]:
!ls

 app.ipynb  'Pandas training.ipynb'   testpandas.xlsx   Untitled.ipynb

In [ ]:
df.to_csv('flights.csv')

In [ ]:
!ls

 app.ipynb    'Pandas training.ipynb'   Untitled.ipynb
 flights.csv   testpandas.xlsx

In [ ]:
!pwd

/workspace/Calculator-

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/Code-Institute-Solutions/sample-datasets/main/penguins.csv')

In [ ]:
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [ ]:
df.to_csv('test_pandas_er.xlsx')

In [ ]:

!ls

'~$test_pandas_er.xlsx'  'Pandas training.ipynb'   Untitled.ipynb
 app.ipynb		  practice_example.csv
 flights.csv		  test_pandas_er.xlsx

In [ ]:
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [ ]:
!pip install --upgrade openpyxl

Requirement already satisfied: openpyxl in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from openpyxl) (1.1.0)

In [ ]:
import openpyxl
wb = openpyxl.load_workbook('test_pandas_er.xlsx')

In [ ]:
df = wb

In [ ]:
df

In [ ]:
df = pd.DataFrame(data, columns=columns)

NameError: name 'data' is not defined

In [ ]:
sheet = wb['Sheet1']

In [ ]:
df = pd.DataFrame(data, columns=columns)

NameError: name 'data' is not defined

In [ ]:
data = sheet.values
columns = next(data)
df = pd.DataFrame(data, columns=columns)

In [ ]:
df

          None  Enero  Febrero  Marzo  Abril
0        Hotel      1        2      3      4
1  Restaurante      2        3      4      5

In [ ]:
df = pd.read_excel('testpandas_1.xlsx')

In [ ]:
df

,Unnamed: 0,Enero,Febrero,Marzo,Abril
0,Ingresos Bar y Restaurante,586384.340000,366758.174200,476665.569039,610968.527500
1,Ventas x Servicios de Restaurante,409040.029800,220054.904500,274925.769629,366581.117500
2,Ventas x Servicios de Bar,177344.310200,146703.269700,201739.799410,244387.410000
3,Ingreso por Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800
4,Servicios de Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800
5,Restaurante gastos,102580.802851,46291.776484,174371.480000,81602.322700
6,Mariscos gastos,46858.565000,42942.430000,38015.000000,65011.480000
7,Bar gastos,80784.790000,58899.850000,100481.560000,116160.301000
8,Hotel gastos,79331.580000,60886.140000,28584.950000,73774.624000
9,Menos Costo de Venta,309555.737851,209020.196484,341452.990000,336548.727700
10,Gastos de Administracion,268254.984000,204772.279500,261645.089201,240507.962212
11,Salarios Fijos,156901.904000,144650.949500,152850.119201,170318.872212
12,Salarios Eventuales,36725.000000,30034.950000,30406.000000,32039.940000
13,INSS,30525.650000,28663.570000,36418.590000,36418.590000
14,INATEC,1502.430000,1422.810000,3288.380000,1730.560000
15,Uniformes,0.000000,0.000000,1617.000000,0.000000
16,Bonos,42600.000000,0.000000,37065.000000,0.000000
17,Gastos del personal,0.000000,0.000000,0.000000,0.000000
18,Gastos Generales,175760.237836,184788.539198,148956.245000,203394.641745
19,Booking.com,16047.773432,32122.222842,0.000000,30254.751410
20,Sistema,2050.520600,2052.085650,0.000000,2055.498250
21,Correo,2886.697496,2888.900754,0.000000,3274.245000
22,Little Hotelier,4642.886732,4646.430393,0.000000,4654.157365
23,Mantenimiento,47025.510000,31633.580000,51462.990000,51076.075200
24,Tren de aseo,2688.000000,1288.000000,1088.000000,688.000000
25,Energia Electrica,25936.280000,28956.250000,26853.450000,31289.780000
26,Servicios Profesionales,9526.230000,9532.450000,9564.970000,9428.330000
27,Agua potable,5548.000000,5548.000000,4638.000000,4196.000000
28,Gas de Cocinar,4280.000000,3280.000000,4625.000000,4606.000000
29,Comida del Personal,20345.000000,18545.000000,0.000000,17520.000000
30,Gestiones admon,7300.390000,11711.000000,25900.785000,7578.000000
31,Internet,2921.538200,2923.768050,0.000000,3347.006000
32,Cable,3367.500000,6761.130000,3378.630000,4511.720000
33,Spotify,217.391476,217.557399,0.000000,217.919195
34,Telefono,5276.780000,6231.790000,6235.420000,6239.440000
35,Seguros,2277.739900,8030.374110,0.000000,7646.719325
36,Transporte,10422.000000,6570.000000,11453.000000,11651.000000
37,Combustible,3000.000000,1850.000000,3756.000000,3160.000000
38,Compra de bienes y servicios,0.000000,0.000000,0.000000,0.000000
39,Gastos de Publicidad,9987.668480,21330.721207,0.000000,12218.027120
40,Facebook,9987.668480,6830.721207,0.000000,12218.027120
41,Propaganda y Publicidad,0.000000,14500.000000,0.000000,0.000000
42,Gastos Financieros,41297.976760,37721.058669,12436.960000,43507.555230
43,Comisiones Banpro,25517.560084,22677.000402,0.000000,27088.333645
44,Comisiones BAC,3216.986676,5392.528267,0.000000,4175.371585
45,Alcaldia,12563.430000,9651.530000,12436.960000,12243.850000
46,Intur,NaN,0.000000,0.000000,0.000000

In [ ]:
df.columns

Index(['Unnamed: 0', 'Enero', 'Febrero', 'Marzo', 'Abril'], dtype='object')

In [ ]:
df.set_index(['Unnamed: 0'], inplace=True)

In [ ]:
df

,Enero,Febrero,Marzo,Abril
Unnamed: 0,,,,
Ingresos Bar y Restaurante,586384.340000,366758.174200,476665.569039,610968.527500
Ventas x Servicios de Restaurante,409040.029800,220054.904500,274925.769629,366581.117500
Ventas x Servicios de Bar,177344.310200,146703.269700,201739.799410,244387.410000
Ingreso por Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800
Servicios de Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800
Restaurante gastos,102580.802851,46291.776484,174371.480000,81602.322700
Mariscos gastos,46858.565000,42942.430000,38015.000000,65011.480000
Bar gastos,80784.790000,58899.850000,100481.560000,116160.301000
Hotel gastos,79331.580000,60886.140000,28584.950000,73774.624000
Menos Costo de Venta,309555.737851,209020.196484,341452.990000,336548.727700
Gastos de Administracion,268254.984000,204772.279500,261645.089201,240507.962212
Salarios Fijos,156901.904000,144650.949500,152850.119201,170318.872212
Salarios Eventuales,36725.000000,30034.950000,30406.000000,32039.940000
INSS,30525.650000,28663.570000,36418.590000,36418.590000
INATEC,1502.430000,1422.810000,3288.380000,1730.560000
Uniformes,0.000000,0.000000,1617.000000,0.000000
Bonos,42600.000000,0.000000,37065.000000,0.000000
Gastos del personal,0.000000,0.000000,0.000000,0.000000
Gastos Generales,175760.237836,184788.539198,148956.245000,203394.641745
Booking.com,16047.773432,32122.222842,0.000000,30254.751410
Sistema,2050.520600,2052.085650,0.000000,2055.498250
Correo,2886.697496,2888.900754,0.000000,3274.245000
Little Hotelier,4642.886732,4646.430393,0.000000,4654.157365
Mantenimiento,47025.510000,31633.580000,51462.990000,51076.075200
Tren de aseo,2688.000000,1288.000000,1088.000000,688.000000
Energia Electrica,25936.280000,28956.250000,26853.450000,31289.780000
Servicios Profesionales,9526.230000,9532.450000,9564.970000,9428.330000
Agua potable,5548.000000,5548.000000,4638.000000,4196.000000
Gas de Cocinar,4280.000000,3280.000000,4625.000000,4606.000000
Comida del Personal,20345.000000,18545.000000,0.000000,17520.000000
Gestiones admon,7300.390000,11711.000000,25900.785000,7578.000000
Internet,2921.538200,2923.768050,0.000000,3347.006000
Cable,3367.500000,6761.130000,3378.630000,4511.720000
Spotify,217.391476,217.557399,0.000000,217.919195
Telefono,5276.780000,6231.790000,6235.420000,6239.440000
Seguros,2277.739900,8030.374110,0.000000,7646.719325
Transporte,10422.000000,6570.000000,11453.000000,11651.000000
Combustible,3000.000000,1850.000000,3756.000000,3160.000000
Compra de bienes y servicios,0.000000,0.000000,0.000000,0.000000
Gastos de Publicidad,9987.668480,21330.721207,0.000000,12218.027120
Facebook,9987.668480,6830.721207,0.000000,12218.027120
Propaganda y Publicidad,0.000000,14500.000000,0.000000,0.000000
Gastos Financieros,41297.976760,37721.058669,12436.960000,43507.555230
Comisiones Banpro,25517.560084,22677.000402,0.000000,27088.333645
Comisiones BAC,3216.986676,5392.528267,0.000000,4175.371585
Alcaldia,12563.430000,9651.530000,12436.960000,12243.850000
Intur,NaN,0.000000,0.000000,0.000000

In [ ]:
df['Total'] = df.sum(axis=1)
df

,Enero,Febrero,Marzo,Abril,Total
Unnamed: 0,,,,,
Ingresos Bar y Restaurante,586384.340000,366758.174200,476665.569039,610968.527500,4.081553e+06
Ventas x Servicios de Restaurante,409040.029800,220054.904500,274925.769629,366581.117500,2.541204e+06
Ventas x Servicios de Bar,177344.310200,146703.269700,201739.799410,244387.410000,1.540350e+06
Ingreso por Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800,5.297606e+06
Servicios de Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800,5.297606e+06
Restaurante gastos,102580.802851,46291.776484,174371.480000,81602.322700,8.096928e+05
Mariscos gastos,46858.565000,42942.430000,38015.000000,65011.480000,3.856550e+05
Bar gastos,80784.790000,58899.850000,100481.560000,116160.301000,7.126530e+05
Hotel gastos,79331.580000,60886.140000,28584.950000,73774.624000,4.851546e+05
Menos Costo de Venta,309555.737851,209020.196484,341452.990000,336548.727700,2.393155e+06
Gastos de Administracion,268254.984000,204772.279500,261645.089201,240507.962212,1.950361e+06
Salarios Fijos,156901.904000,144650.949500,152850.119201,170318.872212,1.249444e+06
Salarios Eventuales,36725.000000,30034.950000,30406.000000,32039.940000,2.584118e+05
INSS,30525.650000,28663.570000,36418.590000,36418.590000,2.640528e+05
INATEC,1502.430000,1422.810000,3288.380000,1730.560000,1.588836e+04
Uniformes,0.000000,0.000000,1617.000000,0.000000,3.234000e+03
Bonos,42600.000000,0.000000,37065.000000,0.000000,1.593300e+05
Gastos del personal,0.000000,0.000000,0.000000,0.000000,0.000000e+00
Gastos Generales,175760.237836,184788.539198,148956.245000,203394.641745,1.425799e+06
Booking.com,16047.773432,32122.222842,0.000000,30254.751410,1.568495e+05
Sistema,2050.520600,2052.085650,0.000000,2055.498250,1.231621e+04
Correo,2886.697496,2888.900754,0.000000,3274.245000,1.809969e+04
Little Hotelier,4642.886732,4646.430393,0.000000,4654.157365,2.788695e+04
Mantenimiento,47025.510000,31633.580000,51462.990000,51076.075200,3.623963e+05
Tren de aseo,2688.000000,1288.000000,1088.000000,688.000000,1.150400e+04
Energia Electrica,25936.280000,28956.250000,26853.450000,31289.780000,2.260715e+05
Servicios Profesionales,9526.230000,9532.450000,9564.970000,9428.330000,7.610396e+04
Agua potable,5548.000000,5548.000000,4638.000000,4196.000000,3.986000e+04
Gas de Cocinar,4280.000000,3280.000000,4625.000000,4606.000000,3.358200e+04
Comida del Personal,20345.000000,18545.000000,0.000000,17520.000000,1.128200e+05
Gestiones admon,7300.390000,11711.000000,25900.785000,7578.000000,1.049804e+05
Internet,2921.538200,2923.768050,0.000000,3347.006000,1.838462e+04
Cable,3367.500000,6761.130000,3378.630000,4511.720000,3.603796e+04
Spotify,217.391476,217.557399,0.000000,217.919195,1.305736e+03
Telefono,5276.780000,6231.790000,6235.420000,6239.440000,4.796686e+04
Seguros,2277.739900,8030.374110,0.000000,7646.719325,3.590967e+04
Transporte,10422.000000,6570.000000,11453.000000,11651.000000,8.019200e+04
Combustible,3000.000000,1850.000000,3756.000000,3160.000000,2.353200e+04
Compra de bienes y servicios,0.000000,0.000000,0.000000,0.000000,0.000000e+00
Gastos de Publicidad,9987.668480,21330.721207,0.000000,12218.027120,8.707283e+04
Facebook,9987.668480,6830.721207,0.000000,12218.027120,5.807283e+04
Propaganda y Publicidad,0.000000,14500.000000,0.000000,0.000000,2.900000e+04
Gastos Financieros,41297.976760,37721.058669,12436.960000,43507.555230,2.699271e+05
Comisiones Banpro,25517.560084,22677.000402,0.000000,27088.333645,1.505658e+05
Comisiones BAC,3216.986676,5392.528267,0.000000,4175.371585,2.556977e+04
Alcaldia,12563.430000,9651.530000,12436.960000,12243.850000,9.379154e+04
Intur,NaN,0.000000,0.000000,0.000000,0.000000e+00

In [ ]:
df = df.rename_axis('Category')

In [ ]:
df

,Enero,Febrero,Marzo,Abril,Total
Category,,,,,
Ingresos Bar y Restaurante,586384.340000,366758.174200,476665.569039,610968.527500,4.081553e+06
Ventas x Servicios de Restaurante,409040.029800,220054.904500,274925.769629,366581.117500,2.541204e+06
Ventas x Servicios de Bar,177344.310200,146703.269700,201739.799410,244387.410000,1.540350e+06
Ingreso por Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800,5.297606e+06
Servicios de Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800,5.297606e+06
Restaurante gastos,102580.802851,46291.776484,174371.480000,81602.322700,8.096928e+05
Mariscos gastos,46858.565000,42942.430000,38015.000000,65011.480000,3.856550e+05
Bar gastos,80784.790000,58899.850000,100481.560000,116160.301000,7.126530e+05
Hotel gastos,79331.580000,60886.140000,28584.950000,73774.624000,4.851546e+05
Menos Costo de Venta,309555.737851,209020.196484,341452.990000,336548.727700,2.393155e+06
Gastos de Administracion,268254.984000,204772.279500,261645.089201,240507.962212,1.950361e+06
Salarios Fijos,156901.904000,144650.949500,152850.119201,170318.872212,1.249444e+06
Salarios Eventuales,36725.000000,30034.950000,30406.000000,32039.940000,2.584118e+05
INSS,30525.650000,28663.570000,36418.590000,36418.590000,2.640528e+05
INATEC,1502.430000,1422.810000,3288.380000,1730.560000,1.588836e+04
Uniformes,0.000000,0.000000,1617.000000,0.000000,3.234000e+03
Bonos,42600.000000,0.000000,37065.000000,0.000000,1.593300e+05
Gastos del personal,0.000000,0.000000,0.000000,0.000000,0.000000e+00
Gastos Generales,175760.237836,184788.539198,148956.245000,203394.641745,1.425799e+06
Booking.com,16047.773432,32122.222842,0.000000,30254.751410,1.568495e+05
Sistema,2050.520600,2052.085650,0.000000,2055.498250,1.231621e+04
Correo,2886.697496,2888.900754,0.000000,3274.245000,1.809969e+04
Little Hotelier,4642.886732,4646.430393,0.000000,4654.157365,2.788695e+04
Mantenimiento,47025.510000,31633.580000,51462.990000,51076.075200,3.623963e+05
Tren de aseo,2688.000000,1288.000000,1088.000000,688.000000,1.150400e+04
Energia Electrica,25936.280000,28956.250000,26853.450000,31289.780000,2.260715e+05
Servicios Profesionales,9526.230000,9532.450000,9564.970000,9428.330000,7.610396e+04
Agua potable,5548.000000,5548.000000,4638.000000,4196.000000,3.986000e+04
Gas de Cocinar,4280.000000,3280.000000,4625.000000,4606.000000,3.358200e+04
Comida del Personal,20345.000000,18545.000000,0.000000,17520.000000,1.128200e+05
Gestiones admon,7300.390000,11711.000000,25900.785000,7578.000000,1.049804e+05
Internet,2921.538200,2923.768050,0.000000,3347.006000,1.838462e+04
Cable,3367.500000,6761.130000,3378.630000,4511.720000,3.603796e+04
Spotify,217.391476,217.557399,0.000000,217.919195,1.305736e+03
Telefono,5276.780000,6231.790000,6235.420000,6239.440000,4.796686e+04
Seguros,2277.739900,8030.374110,0.000000,7646.719325,3.590967e+04
Transporte,10422.000000,6570.000000,11453.000000,11651.000000,8.019200e+04
Combustible,3000.000000,1850.000000,3756.000000,3160.000000,2.353200e+04
Compra de bienes y servicios,0.000000,0.000000,0.000000,0.000000,0.000000e+00
Gastos de Publicidad,9987.668480,21330.721207,0.000000,12218.027120,8.707283e+04
Facebook,9987.668480,6830.721207,0.000000,12218.027120,5.807283e+04
Propaganda y Publicidad,0.000000,14500.000000,0.000000,0.000000,2.900000e+04
Gastos Financieros,41297.976760,37721.058669,12436.960000,43507.555230,2.699271e+05
Comisiones Banpro,25517.560084,22677.000402,0.000000,27088.333645,1.505658e+05
Comisiones BAC,3216.986676,5392.528267,0.000000,4175.371585,2.556977e+04
Alcaldia,12563.430000,9651.530000,12436.960000,12243.850000,9.379154e+04
Intur,NaN,0.000000,0.000000,0.000000,0.000000e+00

In [ ]:
df = pd.read_csv('practice_example.csv')

In [ ]:
df

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

### Missing Data df.isnull() for missing data, df.dropna() to drop and df.fillna() to fill missing data

In [ ]:
np.random.seed(seed=2)
np.random.choice([1,2,3], size=7)

array([1, 2, 1, 3, 3, 1, 3])

In [ ]:
np.random.seed(seed=1)
df=pd.DataFrame(data={'A':np.random.choice([1,2,3,np.nan], size=3),
                      'B':np.random.choice([1, np.nan], size=3),
                      'C':np.random.choice([10,20], size=3),  
                      })
df

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [ ]:
df.isnull()

       A      B      C
0  False  False  False
1   True   True  False
2  False   True  False

In [ ]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [ ]:
df

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [ ]:
df.species

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [ ]:
df.species

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [ ]:
species_counts = df['species'].value_counts()

In [ ]:
species_counts

species
Adelie       152
Gentoo       124
Chinstrap     68
Name: count, dtype: int64

In [ ]:
df.isnull().sum()

Unnamed: 0            0
species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [ ]:
df

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [ ]:
df.dropna()

     A    B   C
0  2.0  1.0  20

In [ ]:
df.dropna(axis=1)

    C
0  20
1  20
2  20

In [ ]:
df.dropna(thresh=1)

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [ ]:
df.dropna(subset=['A'])

     A    B   C
0  2.0  1.0  20
2  1.0  NaN  20

In [ ]:
df

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [ ]:
df

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [ ]:
df

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [ ]:
df.dropna(subset=['bill_length_mm'])

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
5,5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE
...,...,...,...,...,...,...,...,...
338,338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,FEMALE
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [ ]:
df

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [ ]:
df.fillna(value=-4)

     A    B   C
0  2.0  1.0  20
1 -4.0 -4.0  20
2  1.0 -4.0  20

In [ ]:
df['A'].fillna(value=df['A'].sum(),inplace=True)
df

     A    B   C
0  2.0  1.0  20
1  1.5  NaN  20
2  1.0  NaN  20

In [ ]:
df['A'].fillna(value=df['A'].mean(),inplace=True)
df

     A    B   C
0  2.0  1.0  20
1  1.5  NaN  20
2  1.0  NaN  20

In [ ]:
df

     A    B   C
0  2.0  1.0  20
1  1.5  NaN  20
2  1.0  NaN  20

In [ ]:
df = pd.read_csv('practice_example.csv')

In [ ]:
df['flipper_length_mm'].fillna(value=df['flipper_length_mm'].mean(), inplace=True)
df['sex'].fillna(value='MALE', inplace=True)
df

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.000000,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.000000,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.000000,3250.0,FEMALE
3,3,Adelie,Torgersen,NaN,NaN,200.915205,NaN,MALE
4,4,Adelie,Torgersen,36.7,19.3,193.000000,3450.0,FEMALE
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,200.915205,NaN,MALE
340,340,Gentoo,Biscoe,46.8,14.3,215.000000,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.000000,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.000000,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.000000,5400.0,MALE

## Data Exploration

In [ ]:
df = pd.DataFrame (data={'Col1':np.random.randint (low=0, high=50, size=10),
                         'Col2' :np.random. randn(10),
                         'Col3': ['A', 'B', 'C', 'A', 'A', 'C', 'D', 'B', 'A', 'A'],
                         'Col4' :np.random. choice   ([True, False],size=10),
                         'Co15':np.random. randint (low=1, high=4, size=10)},
                    index=pd. date_range (start='01/01/2021', periods=10, freq= 'M'))

df

            Col1      Col2 Col3   Col4  Co15
2021-01-31    49  1.735406    A  False     3
2021-02-28    41  1.125412    B   True     2
2021-03-31    10 -0.182304    C   True     1
2021-04-30     9  0.560422    A   True     2
2021-05-31    10  0.165073    A   True     2
2021-06-30    22  0.762652    C   True     2
2021-07-31     6 -0.328121    D  False     2
2021-08-31     4  3.431369    B  False     3
2021-09-30    39 -0.062790    A  False     1
2021-10-31    29 -0.767343    A  False     2

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2021-01-31 to 2021-10-31
Freq: M
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    10 non-null     int64
 1   Col2    10 non-null     float64
 2   Col3    10 non-null     object
 3   Col4    10 non-null     bool
 4   Co15    10 non-null     int64
dtypes: bool(1), float64(1), int64(2), object(1)
memory usage: 410.0+ bytes

In [ ]:
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [ ]:
df.head(n=3)

            Col1      Col2 Col3   Col4  Co15
2021-01-31     6  0.757859    A  False     3
2021-02-28    14  0.427271    B  False     3
2021-03-31    19  1.162194    C  False     1

In [ ]:
df.tail()

            Col1      Col2 Col3   Col4  Co15
2021-06-30    33  0.717998    C  False     2
2021-07-31    33 -0.409839    D   True     2
2021-08-31    11 -2.465459    B   True     2
2021-09-30    40  0.733871    A  False     3
2021-10-31    44 -1.451487    A   True     1

In [ ]:
df.dtypes

Col1      int64
Col2    float64
Col3     object
Col4       bool
Co15      int64
dtype: object

In [ ]:
df.shape

(10, 5)

In [ ]:
df.columns

Index(['Col1', 'Col2', 'Col3', 'Col4', 'Co15'], dtype='object')

In [ ]:
!pip install openpyxl
df = pd.read_excel('testpandas_1.xlsx')

Requirement already satisfied: openpyxl in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from openpyxl) (1.1.0)

NameError: name 'pd' is not defined

In [ ]:
df

,Unnamed: 0,Enero,Febrero,Marzo,Abril
0,Ingresos Bar y Restaurante,586384.340000,366758.174200,476665.569039,610968.527500
1,Ventas x Servicios de Restaurante,409040.029800,220054.904500,274925.769629,366581.117500
2,Ventas x Servicios de Bar,177344.310200,146703.269700,201739.799410,244387.410000
3,Ingreso por Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800
4,Servicios de Habitaciones,669959.620000,598394.920000,767031.240961,613417.300800
5,Restaurante gastos,102580.802851,46291.776484,174371.480000,81602.322700
6,Mariscos gastos,46858.565000,42942.430000,38015.000000,65011.480000
7,Bar gastos,80784.790000,58899.850000,100481.560000,116160.301000
8,Hotel gastos,79331.580000,60886.140000,28584.950000,73774.624000
9,Menos Costo de Venta,309555.737851,209020.196484,341452.990000,336548.727700
10,Gastos de Administracion,268254.984000,204772.279500,261645.089201,240507.962212
11,Salarios Fijos,156901.904000,144650.949500,152850.119201,170318.872212
12,Salarios Eventuales,36725.000000,30034.950000,30406.000000,32039.940000
13,INSS,30525.650000,28663.570000,36418.590000,36418.590000
14,INATEC,1502.430000,1422.810000,3288.380000,1730.560000
15,Uniformes,0.000000,0.000000,1617.000000,0.000000
16,Bonos,42600.000000,0.000000,37065.000000,0.000000
17,Gastos del personal,0.000000,0.000000,0.000000,0.000000
18,Gastos Generales,175760.237836,184788.539198,148956.245000,203394.641745
19,Booking.com,16047.773432,32122.222842,0.000000,30254.751410
20,Sistema,2050.520600,2052.085650,0.000000,2055.498250
21,Correo,2886.697496,2888.900754,0.000000,3274.245000
22,Little Hotelier,4642.886732,4646.430393,0.000000,4654.157365
23,Mantenimiento,47025.510000,31633.580000,51462.990000,51076.075200
24,Tren de aseo,2688.000000,1288.000000,1088.000000,688.000000
25,Energia Electrica,25936.280000,28956.250000,26853.450000,31289.780000
26,Servicios Profesionales,9526.230000,9532.450000,9564.970000,9428.330000
27,Agua potable,5548.000000,5548.000000,4638.000000,4196.000000
28,Gas de Cocinar,4280.000000,3280.000000,4625.000000,4606.000000
29,Comida del Personal,20345.000000,18545.000000,0.000000,17520.000000
30,Gestiones admon,7300.390000,11711.000000,25900.785000,7578.000000
31,Internet,2921.538200,2923.768050,0.000000,3347.006000
32,Cable,3367.500000,6761.130000,3378.630000,4511.720000
33,Spotify,217.391476,217.557399,0.000000,217.919195
34,Telefono,5276.780000,6231.790000,6235.420000,6239.440000
35,Seguros,2277.739900,8030.374110,0.000000,7646.719325
36,Transporte,10422.000000,6570.000000,11453.000000,11651.000000
37,Combustible,3000.000000,1850.000000,3756.000000,3160.000000
38,Compra de bienes y servicios,0.000000,0.000000,0.000000,0.000000
39,Gastos de Publicidad,9987.668480,21330.721207,0.000000,12218.027120
40,Facebook,9987.668480,6830.721207,0.000000,12218.027120
41,Propaganda y Publicidad,0.000000,14500.000000,0.000000,0.000000
42,Gastos Financieros,41297.976760,37721.058669,12436.960000,43507.555230
43,Comisiones Banpro,25517.560084,22677.000402,0.000000,27088.333645
44,Comisiones BAC,3216.986676,5392.528267,0.000000,4175.371585
45,Alcaldia,12563.430000,9651.530000,12436.960000,12243.850000
46,Intur,NaN,0.000000,0.000000,0.000000

In [ ]:
df.columns

Index(['Unnamed: 0', 'Enero', 'Febrero', 'Marzo', 'Abril'], dtype='object')

In [ ]:
df['Abril'].nunique()

40

In [ ]:
df['Febrero']

0     366758.174200
1     220054.904500
2     146703.269700
3     598394.920000
4     598394.920000
5      46291.776484
6      42942.430000
7      58899.850000
8      60886.140000
9     209020.196484
10    204772.279500
11    144650.949500
12     30034.950000
13     28663.570000
14      1422.810000
15         0.000000
16         0.000000
17         0.000000
18    184788.539198
19     32122.222842
20      2052.085650
21      2888.900754
22      4646.430393
23     31633.580000
24      1288.000000
25     28956.250000
26      9532.450000
27      5548.000000
28      3280.000000
29     18545.000000
30     11711.000000
31      2923.768050
32      6761.130000
33       217.557399
34      6231.790000
35      8030.374110
36      6570.000000
37      1850.000000
38         0.000000
39     21330.721207
40      6830.721207
41     14500.000000
42     37721.058669
43     22677.000402
44      5392.528267
45      9651.530000
46         0.000000
Name: Febrero, dtype: float64

In [ ]:
df['Febrero'].nunique()

42

In [ ]:
df['Febrero'].unique()

array([3.66758174e+05, 2.20054905e+05, 1.46703270e+05, 5.98394920e+05,
       4.62917765e+04, 4.29424300e+04, 5.88998500e+04, 6.08861400e+04,
       2.09020196e+05, 2.04772280e+05, 1.44650950e+05, 3.00349500e+04,
       2.86635700e+04, 1.42281000e+03, 0.00000000e+00, 1.84788539e+05,
       3.21222228e+04, 2.05208565e+03, 2.88890075e+03, 4.64643039e+03,
       3.16335800e+04, 1.28800000e+03, 2.89562500e+04, 9.53245000e+03,
       5.54800000e+03, 3.28000000e+03, 1.85450000e+04, 1.17110000e+04,
       2.92376805e+03, 6.76113000e+03, 2.17557399e+02, 6.23179000e+03,
       8.03037411e+03, 6.57000000e+03, 1.85000000e+03, 2.13307212e+04,
       6.83072121e+03, 1.45000000e+04, 3.77210587e+04, 2.26770004e+04,
       5.39252827e+03, 9.65153000e+03])

In [ ]:
df['Febrero'].value_counts()

Febrero
0.000000         5
598394.920000    2
366758.174200    1
6231.790000      1
5548.000000      1
3280.000000      1
18545.000000     1
11711.000000     1
2923.768050      1
6761.130000      1
217.557399       1
8030.374110      1
28956.250000     1
6570.000000      1
1850.000000      1
21330.721207     1
6830.721207      1
14500.000000     1
37721.058669     1
22677.000402     1
5392.528267      1
9532.450000      1
1288.000000      1
220054.904500    1
144650.949500    1
146703.269700    1
46291.776484     1
42942.430000     1
58899.850000     1
60886.140000     1
209020.196484    1
204772.279500    1
30034.950000     1
31633.580000     1
28663.570000     1
1422.810000      1
184788.539198    1
32122.222842     1
2052.085650      1
2888.900754      1
4646.430393      1
9651.530000      1
Name: count, dtype: int64

In [ ]:
df = pd.read_csv('practice_example.csv')

In [ ]:
df

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [ ]:
df['island'].unique()

array(['Torgersen', 'Biscoe', 'Dream'], dtype=object)

In [ ]:
df['island'].value_counts()

island
Biscoe       168
Dream        124
Torgersen     52
Name: count, dtype: int64

In [ ]:
df['island'].value_counts(normalize=True)

island
Biscoe       0.488372
Dream        0.360465
Torgersen    0.151163
Name: proportion, dtype: float64

In [ ]:
df.describe()

,Unnamed: 0,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g
count,344.000000,342.000000,342.000000,342.000000,342.000000
mean,171.500000,43.921930,17.151170,200.915205,4201.754386
std,99.448479,5.459584,1.974793,14.061714,801.954536
min,0.000000,32.100000,13.100000,172.000000,2700.000000
25%,85.750000,39.225000,15.600000,190.000000,3550.000000
50%,171.500000,44.450000,17.300000,197.000000,4050.000000
75%,257.250000,48.500000,18.700000,213.000000,4750.000000
max,343.000000,59.600000,21.500000,231.000000,6300.000000

In [ ]:
df.describe()

               Enero        Febrero          Marzo          Abril
count      46.000000      47.000000      47.000000      47.000000
mean    89617.415866   69054.718692   85454.812519   87683.520949
std    171948.330693  136458.711311  178071.246350  164228.111655
min         0.000000       0.000000       0.000000       0.000000
25%      3054.246669    3101.884025       0.000000    3310.625500
50%     11492.715000   11711.000000    6235.420000   12218.027120
75%     71255.062500   44617.103242   44738.995000   69393.052000
max    669959.620000  598394.920000  767031.240961  613417.300800

In [ ]:
df.describe(include='all')

            Col1       Col2 Col3   Col4       Co15
count   10.00000  10.000000   10     10  10.000000
unique       NaN        NaN    4      2        NaN
top          NaN        NaN    A  False        NaN
freq         NaN        NaN    5      7        NaN
mean    27.30000   0.119580  NaN    NaN   1.800000
std     12.53484   0.657876  NaN    NaN   1.032796
min      6.00000  -0.699465  NaN    NaN   1.000000
25%     21.25000  -0.362221  NaN    NaN   1.000000
50%     31.00000  -0.051718  NaN    NaN   1.000000
75%     35.00000   0.517439  NaN    NaN   3.000000
max     44.00000   1.443541  NaN    NaN   3.000000

In [ ]:
df = pd.read_csv('practice_example.csv')

In [ ]:
df

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [ ]:
df.describe(include= 'all')

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
count,344.000000,344,344,342.000000,342.000000,342.000000,342.000000,333
unique,NaN,3,3,NaN,NaN,NaN,NaN,2
top,NaN,Adelie,Biscoe,NaN,NaN,NaN,NaN,MALE
freq,NaN,152,168,NaN,NaN,NaN,NaN,168
mean,171.500000,NaN,NaN,43.921930,17.151170,200.915205,4201.754386,NaN
std,99.448479,NaN,NaN,5.459584,1.974793,14.061714,801.954536,NaN
min,0.000000,NaN,NaN,32.100000,13.100000,172.000000,2700.000000,NaN
25%,85.750000,NaN,NaN,39.225000,15.600000,190.000000,3550.000000,NaN
50%,171.500000,NaN,NaN,44.450000,17.300000,197.000000,4050.000000,NaN
75%,257.250000,NaN,NaN,48.500000,18.700000,213.000000,4750.000000,NaN
max,343.000000,NaN,NaN,59.600000,21.500000,231.000000,6300.000000,NaN

In [ ]:
df.corr()

ValueError: could not convert string to float: 'Adelie'

In [ ]:
df

            Col1      Col2 Col3   Col4  Co15
2021-01-31    49  1.735406    A  False     3
2021-02-28    41  1.125412    B   True     2
2021-03-31    10 -0.182304    C   True     1
2021-04-30     9  0.560422    A   True     2
2021-05-31    10  0.165073    A   True     2
2021-06-30    22  0.762652    C   True     2
2021-07-31     6 -0.328121    D  False     2
2021-08-31     4  3.431369    B  False     3
2021-09-30    39 -0.062790    A  False     1
2021-10-31    29 -0.767343    A  False     2

In [ ]:
df.corr(method='pearson')

ValueError: could not convert string to float: 'A'

In [3]:
df

NameError: name 'df' is not defined

In [34]:
df = pd.DataFrame (data={'Col1':np.random.randint (low=0, high=50, size=10),
                         'Col2' :np.random. randn(10),
                         'Col3': ['A', 'B', 'C', 'A', 'A', 'C', 'D', 'B', 'A', 'A'],
                         'Col4' :np.random. choice   ([True, False],size=10),
                         'Co15':np.random. randint (low=1, high=4, size=10)},
                    index=pd. date_range (start='01/01/2021', periods=10, freq= 'M'))

df

            Col1      Col2 Col3   Col4  Co15
2021-01-31    46 -0.086258    A   True     3
2021-02-28    27 -2.018954    B   True     2
2021-03-31    18  0.072340    C   True     1
2021-04-30    40  0.808606    A  False     3
2021-05-31    47 -0.694977    A   True     2
2021-06-30     3  0.615057    C  False     1
2021-07-31     7  0.725565    D  False     3
2021-08-31    28 -0.054995    B  False     2
2021-09-30    34  0.645898    A  False     3
2021-10-31    13  0.257421    A   True     2

In [7]:
df_example = df.copy()
df_example.head()

            Col1      Col2 Col3   Col4  Co15
2021-01-31    13 -1.002489    A   True     2
2021-02-28    11 -0.163197    B   True     3
2021-03-31    35 -1.497050    C   True     2
2021-04-30     9 -3.529743    A   True     1
2021-05-31    20 -0.538222    A  False     3

In [10]:
df_example.columns = ['Revenue', 'Rate', 'ProfileCategory', 'Flag', 'Class']
df_example.head()

            Revenue      Rate ProfileCategory   Flag  Class
2021-01-31       13 -1.002489               A   True      2
2021-02-28       11 -0.163197               B   True      3
2021-03-31       35 -1.497050               C   True      2
2021-04-30        9 -3.529743               A   True      1
2021-05-31       20 -0.538222               A  False      3

In [11]:
df = pd.read_csv('practice_example.csv')

In [12]:
df

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [14]:
df.rename(columns={'species':'Species',
                   'island':'Island',
                   'sex':'Sex'}, inplace=True)
df

,Unnamed: 0,Species,Island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,Sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [16]:
df

            Col1      Col2 Col3   Col4  Co15
2021-01-31    29  1.752319    A  False     2
2021-02-28    43  2.323780    B   True     2
2021-03-31    21 -1.445201    C   True     2
2021-04-30    47 -0.253297    A  False     3
2021-05-31    14  1.088703    A  False     2
2021-06-30    30 -0.768958    C   True     3
2021-07-31    20 -1.662642    D   True     1
2021-08-31     0  3.077836    B   True     1
2021-09-30    15 -0.260216    A  False     1
2021-10-31    43 -0.843199    A  False     1

In [17]:
df.select_dtypes(include='number')

            Col1      Col2  Co15
2021-01-31    29  1.752319     2
2021-02-28    43  2.323780     2
2021-03-31    21 -1.445201     2
2021-04-30    47 -0.253297     3
2021-05-31    14  1.088703     2
2021-06-30    30 -0.768958     3
2021-07-31    20 -1.662642     1
2021-08-31     0  3.077836     1
2021-09-30    15 -0.260216     1
2021-10-31    43 -0.843199     1

In [18]:
df.select_dtypes(include='object')

           Col3
2021-01-31    A
2021-02-28    B
2021-03-31    C
2021-04-30    A
2021-05-31    A
2021-06-30    C
2021-07-31    D
2021-08-31    B
2021-09-30    A
2021-10-31    A

In [19]:
df.select_dtypes(include='boolean')

             Col4
2021-01-31  False
2021-02-28   True
2021-03-31   True
2021-04-30  False
2021-05-31  False
2021-06-30   True
2021-07-31   True
2021-08-31   True
2021-09-30  False
2021-10-31  False

In [22]:
df.select_dtypes(include=['number', 'boolean'])

            Col1      Col2   Col4  Co15
2021-01-31    29  1.752319  False     2
2021-02-28    43  2.323780   True     2
2021-03-31    21 -1.445201   True     2
2021-04-30    47 -0.253297  False     3
2021-05-31    14  1.088703  False     2
2021-06-30    30 -0.768958   True     3
2021-07-31    20 -1.662642   True     1
2021-08-31     0  3.077836   True     1
2021-09-30    15 -0.260216  False     1
2021-10-31    43 -0.843199  False     1

In [23]:
df1=df.reset_index()

In [24]:
df

            Col1      Col2 Col3   Col4  Co15
2021-01-31    29  1.752319    A  False     2
2021-02-28    43  2.323780    B   True     2
2021-03-31    21 -1.445201    C   True     2
2021-04-30    47 -0.253297    A  False     3
2021-05-31    14  1.088703    A  False     2
2021-06-30    30 -0.768958    C   True     3
2021-07-31    20 -1.662642    D   True     1
2021-08-31     0  3.077836    B   True     1
2021-09-30    15 -0.260216    A  False     1
2021-10-31    43 -0.843199    A  False     1

In [25]:
df1

       index  Col1      Col2 Col3   Col4  Co15
0 2021-01-31    29  1.752319    A  False     2
1 2021-02-28    43  2.323780    B   True     2
2 2021-03-31    21 -1.445201    C   True     2
3 2021-04-30    47 -0.253297    A  False     3
4 2021-05-31    14  1.088703    A  False     2
5 2021-06-30    30 -0.768958    C   True     3
6 2021-07-31    20 -1.662642    D   True     1
7 2021-08-31     0  3.077836    B   True     1
8 2021-09-30    15 -0.260216    A  False     1
9 2021-10-31    43 -0.843199    A  False     1

In [26]:
df1.select_dtypes(include='datetime')

       index
0 2021-01-31
1 2021-02-28
2 2021-03-31
3 2021-04-30
4 2021-05-31
5 2021-06-30
6 2021-07-31
7 2021-08-31
8 2021-09-30
9 2021-10-31

In [27]:
df1.select_dtypes(exclude='datetime')

   Col1      Col2 Col3   Col4  Co15
0    29  1.752319    A  False     2
1    43  2.323780    B   True     2
2    21 -1.445201    C   True     2
3    47 -0.253297    A  False     3
4    14  1.088703    A  False     2
5    30 -0.768958    C   True     3
6    20 -1.662642    D   True     1
7     0  3.077836    B   True     1
8    15 -0.260216    A  False     1
9    43 -0.843199    A  False     1

In [28]:
df1.select_dtypes(exclude='boolean')

       index  Col1      Col2 Col3  Co15
0 2021-01-31    29  1.752319    A     2
1 2021-02-28    43  2.323780    B     2
2 2021-03-31    21 -1.445201    C     2
3 2021-04-30    47 -0.253297    A     3
4 2021-05-31    14  1.088703    A     2
5 2021-06-30    30 -0.768958    C     3
6 2021-07-31    20 -1.662642    D     1
7 2021-08-31     0  3.077836    B     1
8 2021-09-30    15 -0.260216    A     1
9 2021-10-31    43 -0.843199    A     1

In [29]:
df=pd.read_csv('practice_example.csv')

In [30]:
df

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [33]:
df.select_dtypes(include='object')

    species     island     sex
0    Adelie  Torgersen    MALE
1    Adelie  Torgersen  FEMALE
2    Adelie  Torgersen  FEMALE
3    Adelie  Torgersen     NaN
4    Adelie  Torgersen  FEMALE
..      ...        ...     ...
339  Gentoo     Biscoe     NaN
340  Gentoo     Biscoe  FEMALE
341  Gentoo     Biscoe    MALE
342  Gentoo     Biscoe  FEMALE
343  Gentoo     Biscoe    MALE

[344 rows x 3 columns]

In [3]:
df = pd.DataFrame (data={'Col1':np.random.randint (low=0, high=50, size=10),
                         'Col2' :np.random. randn(10),
                         'Col3': ['A', 'B', 'C', 'A', 'A', 'C', 'D', 'B', 'A', 'A'],
                         'Col4' :np.random. choice   ([True, False],size=10),
                         'Co15':np.random. randint (low=1, high=4, size=10)},
                    index=pd. date_range (start='01/01/2021', periods=10, freq= 'M'))

df

            Col1      Col2 Col3   Col4  Co15
2021-01-31     1 -0.971421    A   True     1
2021-02-28    34 -1.843341    B  False     3
2021-03-31    17 -1.454471    C   True     3
2021-04-30    35  0.455256    A   True     3
2021-05-31     2  0.431169    A  False     2
2021-06-30     1  0.982249    C  False     2
2021-07-31    44  0.694157    D   True     1
2021-08-31     6 -1.133228    B   True     3
2021-09-30    30  0.719517    A  False     3
2021-10-31    30 -0.015403    A  False     1

In [36]:
df.to_numpy()

array([[9, 1.0600742225326338, 'A', False, 1],
       [6, 1.031007101020277, 'B', False, 3],
       [12, -0.9442618081286438, 'C', False, 1],
       [27, -1.7240926719470897, 'A', True, 2],
       [47, 1.0881248713228568, 'A', True, 3],
       [14, -2.813261002600084, 'C', True, 3],
       [37, 1.5282378845491336, 'D', False, 3],
       [5, -2.8972003580708763, 'B', True, 1],
       [49, -1.07622451612704, 'A', False, 1],
       [40, -0.4447682282897, 'A', False, 1]], dtype=object)

In [37]:
df.values

array([[9, 1.0600742225326338, 'A', False, 1],
       [6, 1.031007101020277, 'B', False, 3],
       [12, -0.9442618081286438, 'C', False, 1],
       [27, -1.7240926719470897, 'A', True, 2],
       [47, 1.0881248713228568, 'A', True, 3],
       [14, -2.813261002600084, 'C', True, 3],
       [37, 1.5282378845491336, 'D', False, 3],
       [5, -2.8972003580708763, 'B', True, 1],
       [49, -1.07622451612704, 'A', False, 1],
       [40, -0.4447682282897, 'A', False, 1]], dtype=object)

In [38]:
df.value_counts

<bound method DataFrame.value_counts of             Col1      Col2 Col3   Col4  Co15
2021-01-31     9  1.060074    A  False     1
2021-02-28     6  1.031007    B  False     3
2021-03-31    12 -0.944262    C  False     1
2021-04-30    27 -1.724093    A   True     2
2021-05-31    47  1.088125    A   True     3
2021-06-30    14 -2.813261    C   True     3
2021-07-31    37  1.528238    D  False     3
2021-08-31     5 -2.897200    B   True     1
2021-09-30    49 -1.076225    A  False     1
2021-10-31    40 -0.444768    A  False     1>

In [1]:
df

NameError: name 'df' is not defined

In [6]:
df

            Col1      Col2 Col3   Col4  Co15
2021-01-31    26  0.696095    A  False     3
2021-02-28    30 -1.295590    B  False     3
2021-03-31    28 -0.214541    C  False     2
2021-04-30    32 -0.031587    A   True     1
2021-05-31     4 -1.161638    A  False     2
2021-06-30    49  1.146648    C   True     2
2021-07-31    46  0.387797    D  False     2
2021-08-31    40 -0.396326    B   True     1
2021-09-30    22  1.126240    A   True     2
2021-10-31    18 -1.150774    A   True     1

In [7]:
map_dict = {'A': 'Nice', 'B': 'Super', 'C': 'Amazing', 'D': 'Incredible'}
map_dict

{'A': 'Nice', 'B': 'Super', 'C': 'Amazing', 'D': 'Incredible'}

In [8]:
df['Col3'].replace(to_replace=map_dict, inplace=True)
df

            Col1      Col2        Col3   Col4  Co15
2021-01-31    26  0.696095        Nice  False     3
2021-02-28    30 -1.295590       Super  False     3
2021-03-31    28 -0.214541     Amazing  False     2
2021-04-30    32 -0.031587        Nice   True     1
2021-05-31     4 -1.161638        Nice  False     2
2021-06-30    49  1.146648     Amazing   True     2
2021-07-31    46  0.387797  Incredible  False     2
2021-08-31    40 -0.396326       Super   True     1
2021-09-30    22  1.126240        Nice   True     2
2021-10-31    18 -1.150774        Nice   True     1

In [9]:
df.dtypes

Col1      int64
Col2    float64
Col3     object
Col4       bool
Co15      int64
dtype: object

In [10]:
df = pd.read_csv('practice_example.csv')
df

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [11]:
map_dict = {'MALE': 'Male', 'FEMALE': 'Female'}
map_dict

{'MALE': 'Male', 'FEMALE': 'Female'}

In [12]:
df['sex'].replace(to_replace=map_dict, inplace=True)
df

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...,...
339,339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [4]:
df

            Col1      Col2 Col3   Col4  Co15
2021-01-31     1 -0.971421    A   True     1
2021-02-28    34 -1.843341    B  False     3
2021-03-31    17 -1.454471    C   True     3
2021-04-30    35  0.455256    A   True     3
2021-05-31     2  0.431169    A  False     2
2021-06-30     1  0.982249    C  False     2
2021-07-31    44  0.694157    D   True     1
2021-08-31     6 -1.133228    B   True     3
2021-09-30    30  0.719517    A  False     3
2021-10-31    30 -0.015403    A  False     1

In [7]:
df.astype({'Col2':'object'})

            Col1      Col2 Col3   Col4  Co15
2021-01-31     1 -0.971421    A   True     1
2021-02-28    34 -1.843341    B  False     3
2021-03-31    17 -1.454471    C   True     3
2021-04-30    35  0.455256    A   True     3
2021-05-31     2  0.431169    A  False     2
2021-06-30     1  0.982249    C  False     2
2021-07-31    44  0.694157    D   True     1
2021-08-31     6 -1.133228    B   True     3
2021-09-30    30  0.719517    A  False     3
2021-10-31    30 -0.015403    A  False     1

In [8]:
df.dtypes

Col1      int64
Col2    float64
Col3     object
Col4       bool
Co15      int64
dtype: object

In [25]:
df_practice = pd.read_csv('https://raw.githubusercontent.com/Code-Institute-Solutions/sample-datasets/main/titanic.csv')

In [26]:
df_practice

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [27]:
df_practice[['survived', 'pclass']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
dtypes: int64(2)
memory usage: 14.0 KB

In [49]:
df_practice = df_practice.astype({'survived': bool, 'pclass': object})
df_practice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    bool
 1   pclass       891 non-null    object
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(3), float64(2), int64(2), object(8)
memory usage: 86.3+ KB

In [50]:
df = pd.DataFrame(data={'Name': ['John', 'Marie', 'Joseph', 'John', 'William', 'Marie'],
                        'CustomRate': [1,2,2,4,3,3]})

In [51]:
df

      Name  CustomRate
0     John           1
1    Marie           2
2   Joseph           2
3     John           4
4  William           3
5    Marie           3

In [55]:
df.duplicated(subset=['Name'], keep=False)

0     True
1     True
2    False
3     True
4    False
5     True
dtype: bool

In [54]:
df[df.duplicated(subset=['Name'])]

    Name  CustomRate
3   John           4
5  Marie           3

In [56]:
df.drop_duplicates(subset=['Name'], inplace=True)
df

      Name  CustomRate
0     John           1
1    Marie           2
2   Joseph           2
4  William           3

In [70]:
np.random.seed(seed=1)
df_practice = pd.DataFrame (data = {'Product_ID': np.random.randint (low=2, high=8, size=12),
                                    'Customer_ID':np.random.randint (low=1, high=8, size=12),
                                    'Value':np.random.randint(low=900, high=999, size=12)

                                    })

df_practice

    Product_ID  Customer_ID  Value
0            7            5    928
1            5            7    929
2            6            2    914
3            2            3    950
4            3            5    968
5            5            7    987
6            7            6    987
7            2            3    994
8            2            5    996
9            3            4    986
10           6            5    913
11           7            3    909

In [64]:
df.duplicated()

0    False
1    False
2    False
4    False
dtype: bool

In [65]:
df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [Name, CustomRate]
Index: []

In [72]:
df_practice[df_practice.duplicated(subset=['Product_ID', 'Customer_ID'], keep=False)]

   Product_ID  Customer_ID  Value
1           5            7    929
3           2            3    950
5           5            7    987
7           2            3    994

In [76]:
df_practice.drop_duplicates(subset=['Product_ID', 'Customer_ID'], inplace=True)

In [77]:
df_practice

    Product_ID  Customer_ID  Value
0            7            5    928
1            5            7    929
2            6            2    914
3            2            3    950
4            3            5    968
6            7            6    987
8            2            5    996
9            3            4    986
10           6            5    913
11           7            3    909

### Time Series

                  Date  Col1
0  2019-10-27 00:00:00    30
1  2019-10-27 01:00:00    28
2  2019-10-27 02:00:00    29
3  2019-10-27 03:00:00    23
4  2019-10-27 04:00:00    28
5  2019-10-27 05:00:00    28
6  2019-10-27 06:00:00    20
7  2019-10-27 07:00:00    25
8  2019-10-27 08:00:00    33
9  2019-10-27 09:00:00    23
10 2019-10-27 10:00:00    30
11 2019-10-27 11:00:00    31
12 2019-10-27 12:00:00    29
13 2019-10-27 13:00:00    29
14 2019-10-27 14:00:00    30
15 2019-10-27 15:00:00    25
16 2019-10-27 16:00:00    27
17 2019-10-27 17:00:00    26
18 2019-10-27 18:00:00    20
19 2019-10-27 19:00:00    24
20 2019-10-27 20:00:00    32
21 2019-10-27 21:00:00    33
22 2019-10-27 22:00:00    27
23 2019-10-27 23:00:00    34

In [105]:
df_date['Hour'] = df_date['Date'].dt.hour
df_date['Minute'] = df_date['Date'].dt.minute
df_date['Year'] = df_date['Date'].dt.hour

In [106]:
df_date

                  Date  Col1  Hour  Minute  Year
0  2019-10-27 00:00:00    30     0       0     0
1  2019-10-27 01:00:00    28     1       0     1
2  2019-10-27 02:00:00    29     2       0     2
3  2019-10-27 03:00:00    23     3       0     3
4  2019-10-27 04:00:00    28     4       0     4
5  2019-10-27 05:00:00    28     5       0     5
6  2019-10-27 06:00:00    20     6       0     6
7  2019-10-27 07:00:00    25     7       0     7
8  2019-10-27 08:00:00    33     8       0     8
9  2019-10-27 09:00:00    23     9       0     9
10 2019-10-27 10:00:00    30    10       0    10
11 2019-10-27 11:00:00    31    11       0    11
12 2019-10-27 12:00:00    29    12       0    12
13 2019-10-27 13:00:00    29    13       0    13
14 2019-10-27 14:00:00    30    14       0    14
15 2019-10-27 15:00:00    25    15       0    15
16 2019-10-27 16:00:00    27    16       0    16
17 2019-10-27 17:00:00    26    17       0    17
18 2019-10-27 18:00:00    20    18       0    18
19 2019-10-27 19:00:00    24    19       0    19
20 2019-10-27 20:00:00    32    20       0    20
21 2019-10-27 21:00:00    33    21       0    21
22 2019-10-27 22:00:00    27    22       0    22
23 2019-10-27 23:00:00    34    23       0    23

In [115]:
np.random.seed(seed=1)

df = pd.DataFrame (data={'Price': np.random.randint(low=20, high=35, size=28)},
                     index=pd.date_range (start='27/10/2019 00:00:00', periods=28, freq='D'))

df.head(10)

            Price
2019-10-27     25
2019-10-28     31
2019-10-29     32
2019-10-30     28
2019-10-31     29
2019-11-01     31
2019-11-02     25
2019-11-03     20
2019-11-04     20
2019-11-05     21

In [116]:
df_resample = df.resample(rule='D').sum()
df_resample

            Price
2019-10-27     25
2019-10-28     31
2019-10-29     32
2019-10-30     28
2019-10-31     29
2019-11-01     31
2019-11-02     25
2019-11-03     20
2019-11-04     20
2019-11-05     21
2019-11-06     32
2019-11-07     27
2019-11-08     33
2019-11-09     32
2019-11-10     26
2019-11-11     29
2019-11-12     22
2019-11-13     24
2019-11-14     34
2019-11-15     25
2019-11-16     22
2019-11-17     24
2019-11-18     31
2019-11-19     32
2019-11-20     30
2019-11-21     32
2019-11-22     33
2019-11-23     34

### Moving Average

In [117]:
np.random.seed(seed=101)

df = pd.DataFrame (data={'Revenue': np.random.randint(low=200, high=350, size=15)},
                     index=pd.date_range (start='10/10/2020', periods=15, freq='D'))

df

            Revenue
2020-10-10      295
2020-10-11      211
2020-10-12      281
2020-10-13      270
2020-10-14      263
2020-10-15      287
2020-10-16      275
2020-10-17      337
2020-10-18      240
2020-10-19      332
2020-10-20      263
2020-10-21      260
2020-10-22      310
2020-10-23      205
2020-10-24      340

In [118]:
df_ex = df.copy()
df_ex

            Revenue
2020-10-10      295
2020-10-11      211
2020-10-12      281
2020-10-13      270
2020-10-14      263
2020-10-15      287
2020-10-16      275
2020-10-17      337
2020-10-18      240
2020-10-19      332
2020-10-20      263
2020-10-21      260
2020-10-22      310
2020-10-23      205
2020-10-24      340

In [119]:
df_ex['RevenueMovingAvg'] = df_ex['Revenue'].rolling(window=4).mean()

In [120]:
df_ex

            Revenue  RevenueMovingAvg
2020-10-10      295               NaN
2020-10-11      211               NaN
2020-10-12      281               NaN
2020-10-13      270            264.25
2020-10-14      263            256.25
2020-10-15      287            275.25
2020-10-16      275            273.75
2020-10-17      337            290.50
2020-10-18      240            284.75
2020-10-19      332            296.00
2020-10-20      263            293.00
2020-10-21      260            273.75
2020-10-22      310            291.25
2020-10-23      205            259.50
2020-10-24      340            278.75

In [123]:
df

            Revenue
2020-10-10      295
2020-10-11      211
2020-10-12      281
2020-10-13      270
2020-10-14      263
2020-10-15      287
2020-10-16      275
2020-10-17      337
2020-10-18      240
2020-10-19      332
2020-10-20      263
2020-10-21      260
2020-10-22      310
2020-10-23      205
2020-10-24      340

In [130]:
df['Percentage Change'] = df['Revenue'].pct_change(periods=1) * 100

In [4]:
import seaborn as sns

ModuleNotFoundError: No module named 'seaborn'

In [5]:
!pip install seaborn

Collecting seaborn
  Downloading seaborn-0.12.2-py3-none-any.whl (293 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 293.3/293.3 kB 8.8 MB/s eta 0:00:00
Requirement already satisfied: numpy!=1.24.0,>=1.17 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from seaborn) (1.25.0)
Requirement already satisfied: pandas>=0.25 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from seaborn) (2.0.2)
Collecting matplotlib!=3.6.1,>=3.1 (from seaborn)
  Downloading matplotlib-3.7.1-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.6/11.6 MB 53.3 MB/s eta 0:00:0000:010:01
Collecting contourpy>=1.0.1 (from matplotlib!=3.6.1,>=3.1->seaborn)
  Downloading contourpy-1.1.0-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (300 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 300.4/300.4 kB 54.4 MB/s eta 0:00:00
Collecting cycler>=0.10 (from matplotlib!=3.6.1,>=3.1->seaborn)
  Downloading cycler-0.11.0-py3-none-any.whl (6.4 kB)
Collecting fonttools>=4.22.0 (from matplotlib!=3.6.1,>=3.1->seaborn)
  Downloading fonttools-4.40.0-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (4.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 4.3/4.3 MB 96.2 MB/s eta 0:00:00:00:01
Collecting kiwisolver>=1.0.1 (from matplotlib!=3.6.1,>=3.1->seaborn)
  Downloading kiwisolver-1.4.4-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (1.4 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.4/1.4 MB 86.5 MB/s eta 0:00:00
Requirement already satisfied: packaging>=20.0 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (23.0)
Collecting pillow>=6.2.0 (from matplotlib!=3.6.1,>=3.1->seaborn)
  Downloading Pillow-9.5.0-cp311-cp311-manylinux_2_28_x86_64.whl (3.4 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.4/3.4 MB 109.5 MB/s eta 0:00:00
Collecting pyparsing>=2.3.1 (from matplotlib!=3.6.1,>=3.1->seaborn)
  Downloading pyparsing-3.1.0-py3-none-any.whl (102 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 102.6/102.6 kB 30.9 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.7 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from pandas>=0.25->seaborn) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from pandas>=0.25->seaborn) (2023.3)
Requirement already satisfied: six>=1.5 in /home/gitpod/.pyenv/versions/3.11.1/lib/python3.11/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib, seaborn
Successfully installed contourpy-1.1.0 cycler-0.11.0 fonttools-4.40.0 kiwisolver-1.4.4 matplotlib-3.7.1 pillow-9.5.0 pyparsing-3.1.0 seaborn-0.12.2

In [6]:
import seaborn as sns

In [7]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [7]:
df = sns.load_dataset('diamonds')
df.head(100)
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [10]:
def sum_of_xyz(df):

    return df['x'] + df['y'] + df['z']

df['xyzSum'] = df.apply(sum_of_xyz, axis=1)

def multiply_price_by_4(price):

    return price * 4

df['price_times_4'] = df[['price']].apply(multiply_price_by_4, axis=1)

df

,carat,cut,color,clarity,depth,table,price,x,y,z,xyzSum,price_times_4
0,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43,10.36,1304
1,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31,10.04,1304
2,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31,10.43,1308
3,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63,11.06,1336
4,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75,11.44,1340
...,...,...,...,...,...,...,...,...,...,...,...,...
53935,0.72,Ideal,D,SI1,60.8,57.0,2757,5.75,5.76,3.50,15.01,11028
53936,0.72,Good,D,SI1,63.1,55.0,2757,5.69,5.75,3.61,15.05,11028
53937,0.70,Very Good,D,SI1,62.8,60.0,2757,5.66,5.68,3.56,14.90,11028
53938,0.86,Premium,H,SI2,61.0,58.0,2757,6.15,6.12,3.74,16.01,11028
53939,0.75,Ideal,D,SI2,62.2,55.0,2757,5.83,5.87,3.64,15.34,11028

### Lambda functions

In [8]:
df

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

In [9]:
df

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

In [10]:
df = sns.load_dataset('diamonds')
df.head(100)
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [11]:
variable = (lambda x: x + 10)(45)
variable

55

In [12]:
variable = (lambda x,y: x + 3 * y)(2,1)
variable

5

In [13]:
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [14]:
def my_price_perception(price, cut):
    if cut in ['Premium', 'Ideal'] and price < 2000:
        return 'Worth it, buy now'
    elif price < 1000:
        return 'Buy'
    elif price < 2500:
        return 'Think twice'
    else:
        return 'No thanks'

In [17]:
df['MyValuePerception'] = df.apply(lambda x: my_price_perception(x['price'], x['cut']), axis=1)
df

,carat,cut,color,clarity,depth,table,price,x,y,z,MyValuePerception
0,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43,"Worth it, buy now"
1,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31,"Worth it, buy now"
2,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31,Buy
3,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63,"Worth it, buy now"
4,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75,Buy
...,...,...,...,...,...,...,...,...,...,...,...
53935,0.72,Ideal,D,SI1,60.8,57.0,2757,5.75,5.76,3.50,No thanks
53936,0.72,Good,D,SI1,63.1,55.0,2757,5.69,5.75,3.61,No thanks
53937,0.70,Very Good,D,SI1,62.8,60.0,2757,5.66,5.68,3.56,No thanks
53938,0.86,Premium,H,SI2,61.0,58.0,2757,6.15,6.12,3.74,No thanks
53939,0.75,Ideal,D,SI2,62.2,55.0,2757,5.83,5.87,3.64,No thanks

In [20]:
df.head(100)['MyValuePerception'].value_counts()

MyValuePerception
Buy                  52
Worth it, buy now    38
No thanks            10
Name: count, dtype: int64